Documents/абс_ЗаявкаНаБюджетОтделаТМ/абс_ЗаявкаНаБюджетОтделаТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаБюджетОтделаТМ</name>
  <registerRecords>AccumulationRegister.абс_БюджетОтделаТМ</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкиНаБюджетТМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОтнесенияЗатрат</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаБюджета</name>
    <type>
      <types>CatalogRef.абс_АналитикиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/абс_БюджетОтделаТМ/абс_БюджетОтделаТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_БюджетОтделаТМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Enums/абс_ВидыОперацийЗаявкиНаБюджетТМ/абс_ВидыОперацийЗаявкиНаБюджетТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийЗаявкиНаБюджетТМ</name>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыОплатУслугКонтрагентов/абс_ВидыОплатУслугКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОплатУслугКонтрагентов</name>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_ЗаявкаНаБюджетОтделаТМ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка;
	ИначеЕсли Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.Взаимозачет Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.Взаимозачет;
   	ИначеЕсли Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.ПредоставлениеСкидки Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка Тогда
		ЭтаФорма.Элементы.Товары.Видимость=Истина;
		ЭтаФорма.Элементы.СуммаДокумента.Видимость=Ложь;
	Иначе
		ЭтаФорма.Элементы.Товары.Видимость=Ложь;
		ЭтаФорма.Элементы.СуммаДокумента.Видимость=Истина;
	КонецЕсли;
	
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка 
		ИЛИ Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.ПредоставлениеСкидки Тогда
		ЭтаФорма.Элементы.Закрыта.Видимость = Ложь;
		ЭтаФорма.Элементы.РегистрЗакрыт.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.Закрыта.Видимость = Истина;
		ЭтаФорма.Элементы.РегистрЗакрыт.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РассчитатьРегистрЗакрыт()
	
	обДокумент = РеквизитФормыВЗначение("Объект");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА абс_БюджетОтделаТМОбороты.СуммаПриход = абс_БюджетОтделаТМОбороты.СуммаРасход
		|				И абс_БюджетОтделаТМОбороты.СуммаПриход <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РегистрЗакрыт
		|ИЗ
		|	РегистрНакопления.абс_БюджетОтделаТМ.Обороты(, , , ЗаявкаНаБюджетОтделаТМ = &ЗаявкаНаБюджетОтделаТМ) КАК абс_БюджетОтделаТМОбороты";

	Запрос.УстановитьПараметр("ЗаявкаНаБюджетОтделаТМ", обДокумент.Ссылка);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат ЛОЖЬ;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.РегистрЗакрыт;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект, ЭтаФорма);
	УстановитьВидимость();
	РегистрЗакрыт = РассчитатьРегистрЗакрыт();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииНоменклатуры(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатуры(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, );
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииКоличества(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличества(НомерСтроки);
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];	
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияМестПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЕдиницыМест(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЕдиницыМест(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
    ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииКоличестваМест(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличестваМест(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
    ОбработкаТабличныхЧастей.РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЕдиницыИзмерения(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЕдиницыИзмерения(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЦены(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЦены(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
    ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииСуммы(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСуммы(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ПараметрыСеанса.ТекущийПользователь);
    ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеКопирования") Тогда
		Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
			Объект.Закрыта = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры
